[
    {
        "title": "Unmasking the Hidden Costs: How to Identify and Plug Profit Leaks in Your Restaurant",
        "description": "Every restaurant owner dreams of a thriving business, bustling with happy customers and healthy profits. Yet, for many, the reality is a constant battle against rising costs and shrinking margins. You see the sales numbers, but the cash in the bank doesn't quite add up. This disconnect often points to **profit leaks** – insidious drains on your revenue that can go unnoticed until they've significantly impacted your bottom line. These aren't always obvious, like a broken piece of equipment; they're often subtle inefficiencies embedded within your daily operations.",
        "file_name": "blog_post_1_profit_leaks_rewritten.html",
        "output_path": "tre-coleman-site/blog/blog_post_1_profit_leaks_rewritten.html"
    },
    {
        "title": "Beyond the Daily Grind: Implementing Systems for Sustainable Restaurant Growth",
        "description": "In the fast-paced world of hospitality, restaurant owners and managers often find themselves caught in a relentless cycle of daily tasks – putting out fires, managing staff, and ensuring customer satisfaction. This **\"daily grind\"** can be all-consuming, leaving little room for strategic thinking or long-term planning. While effort and dedication are undoubtedly crucial, relying solely on them for success is a precarious strategy. As I often emphasize, \"Most hospitality businesses don't fail from lack of effort. They fail because effort is doing the work of systems.\"",
        "file_name": "blog_post_2_systems_growth_rewritten.html",
        "output_path": "tre-coleman-site/blog/blog_post_2_systems_growth_rewritten.html"
    },
    {
        "title": "Maximizing My Menu's Potential: A Guide to Restaurant Menu Engineering",
        "description": "Your restaurant’s menu is far more than just a list of dishes and prices; it’s a powerful marketing tool, a reflection of your brand, and, most importantly, a direct driver of your profitability. Yet, many restaurant owners overlook its strategic potential, allowing sentimentality or tradition to dictate its contents rather than data-driven insights. An underperforming menu can be a significant **profit leak**, silently eroding your margins and hindering your business’s growth.",
        "file_name": "blog_post_3_menu_engineering_rewritten.html",
        "output_path": "tre-coleman-site/blog/blog_post_3_menu_engineering_rewritten.html"
    },
    {
        "title": "The Strategic Advantage: How Fractional COO Services Elevate Restaurant Operations",
        "description": "For many growing restaurants, the journey from a successful single unit to a multi-location enterprise or a highly efficient, profitable operation often hits a wall. The demands of daily operations become overwhelming, strategic planning takes a backseat, and you, the owner—once the visionary—find yourself bogged down in tactical execution. This is where the need for executive-level operational leadership becomes critical, but the cost of a full-time Chief Operating Officer (COO) can be prohibitive for many small to medium-sized hospitality businesses.",
        "file_name": "blog_post_4_fractional_coo_rewritten.html",
        "output_path": "tre-coleman-site/blog/blog_post_4_fractional_coo_rewritten.html"
    },
    {
        "title": "From Food Truck to Empire: Scaling My Catering Business Profitably",
        "description": "The catering industry, whether as a standalone business or an extension of a restaurant or food truck, offers immense potential for revenue growth. However, many operators find that as their catering volume increases, so do their headaches – and often, their losses. What seems like a straightforward path to expansion can quickly become a complex web of logistical challenges, hidden costs, and unexpected profit leaks. The dream of building a catering empire can turn into a nightmare of razor-thin margins and operational inefficiencies.",
        "file_name": "blog_post_5_catering_profitability_rewritten.html",
        "output_path": "tre-coleman-site/blog/blog_post_5_catering_profitability_rewritten.html"
    }
]